{
  "announcements": [
    {
      "id": 1,
      "title": "Appointment of Mr. Siddharth Raja as Executive Dean of VMLS",
      "description": "Vinayaka Mission’s Research Foundation announces the appointment of Mr. Siddharth Raja as Executive Dean of Vinayaka Mission’s Law School, bringing nearly three decades of global legal practice and academic engagement to advance a future-ready, multidisciplinary legal education.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": ["Events", "VMLS", "Leadership", "Legal-Education"],
      "link": "https://vmls.edu.in/news/appointment-of-executive-dean.html"
    },
    {
      "id": 2,
      "title": "VMRF Signs MoU with K-KCCS India to Strengthen Japan Pathways for Students",
      "description": "Vinayaka Missions Research Foundation signs an MoU with K-KCCS India Private Limited to advance Japanese language training, internships, placements, higher education pathways, and industry-aligned student development opportunities in India and Japan.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": ["Events", "VMRF", "MoU", "Japan-Pathways", "Global-Education"],
      "link": "https://vmls.edu.in/news/vmrf-signs-mou-with-k-kccs-india-to-strengthen-japan-pathways-for-students.html"
    },
    {
      "id": 3,
      "title": "Research: Importance & Application After Law School",
      "description": "The VMLS Research Committee organized a guest lecture on the importance and practical application of legal research after law school, led by Mr. Vignesh Ram Hariharan, offering final-year LLB students actionable insights into research-driven legal practice.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": [
        "Events",
        "VMLS",
        "Research",
        "Guest-Lecture",
        "Legal-Education"
      ],
      "link": "https://vmls.edu.in/news/research-importance-application-after-law-school.html"
    },
    {
      "id": 4,
      "title": "Guest Lecture on Ethics of Research and the Qualities of a Legal Researcher",
      "description": "The VMLS Research Committee organized a guest lecture on research ethics and the core qualities of an effective legal researcher, delivered by Mr. Harsh Mahaseth, Assistant Professor at Jindal Global Law School, emphasizing integrity, analytical rigor, and professional responsibility.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": [
        "Events",
        "VMLS",
        "Research-Ethics",
        "Guest-Lecture",
        "Legal-Research"
      ],
      "link": "https://vmls.edu.in/news/lecture-ethics-of-research.html"
    },
    {
      "id": 5,
      "title": "Guest Lecture on the Art of Research in Corporate and Commercial Laws",
      "description": "The VMLS Research Committee hosted a guest lecture on research methodologies in corporate and commercial laws, delivered by Ms. Utkarsha Nikam, In-house Legal Counsel (UK), offering students practical insights into interdisciplinary research, case analysis, and career preparation in corporate law.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": [
        "Events",
        "VMLS",
        "Corporate-Law",
        "Commercial-Law",
        "Guest-Lecture",
        "Legal-Research"
      ],
      "link": "https://vmls.edu.in/news/lecture-corporate-commercial-laws.html"
    },
    {
      "id": 6,
      "title": "1st CJT Lecture on Digitization of Courts in India",
      "description": "The Center for Justice through Technology (CJT), in collaboration with VMLS, hosted its first CJT Lecture focusing on the digitization of courts in India, examining the E-Courts Integrated Mission Mode Project and the role of technology in improving access to justice.",
      "date": "Dec 24, 2025",
      "category": "Events",
      "tags": [
        "Events",
        "VMLS",
        "CJT",
        "E-Courts",
        "Legal-Tech",
        "Judicial-Reform"
      ],
      "link": "https://vmls.edu.in/news/1st-CJT-Lecture.html"
    },
    {
      "id": 7,
      "title": "Inauguration of the Third Cohort at Vinayaka Mission’s Law School",
      "description": "Vinayaka Mission’s Law School inaugurated its third cohort for the 5-year and 3-year law programmes on September 11, 2023, in the presence of Hon’ble Justice Ibrahim Kalifulla, former Judge of the Supreme Court of India, and Dr. Sudhir Krishnaswamy, Vice-Chancellor of NLSIU.",
      "date": "Sep 11, 2023",
      "category": "Events",
      "tags": [
        "Events",
        "VMLS",
        "Inauguration"
      ],
      "link": "https://vmls.edu.in/news/inauguration-day.html"
    }
  ]
}
